app/views/pitches/index.html.erb

  <!--Input: string + number-->
  <!--<%= bar_chart Track.group(:track_version).sum(:pitch) %>-->
  <!--Input: only numbers-->
  <%= scatter_chart Track.pluck(:track_number, :pitch), xtitle: "Track Number", ytitle: "Pitch" %>
---
SELECT SUM(`tracks`.`pitch`) AS sum_pitch, `tracks`.`track_version` AS tracks_track_version FROM `tracks` GROUP BY `tracks`.`track_version`
SELECT `tracks`.`track_version`, `tracks`.`pitch` FROM `tracks`
SELECT `tracks`.`track_number`, `tracks`.`pitch` FROM `tracks`