app/controllers/names_controller.rb

SELECT DISTINCT `tracks`.* FROM `tracks` GROUP BY `tracks`.`track_number` ORDER BY track_number ASC, track_version ASC
SELECT `tracks`.* FROM `tracks` GROUP BY `tracks`.`track_number` ORDER BY track_number ASC, track_version ASC
---
  def index
    @tracks=Array.new
    tracknumbers = Track.select(:track_number).distinct.sorted_by_name
    tracknumbers.each do |tn|

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = NULL LIMIT 1
---
  def show
    singletrack=Track.find(params[:id])