app/controllers/public_controller.rb

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`visible` = 1 AND `tracks`.`permalink` = 'frog' ORDER BY `tracks`.`id` ASC LIMIT 1
---
  def show
    @track = Track.visible.where(:permalink => params[:permalink]).first