app/controllers/tags_controller.rb

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 0 LIMIT 1
---
  def show
    @tag = Tag.find(params[:id])

INSERT INTO `tags` (`name`, `permalink`, `visible`, `created_at`, `updated_at`) VALUES ('Tag 1', 'tag1', 1, '2017-09-08 11:51:35', '2017-09-08 11:51:35')
---
  def create
    # Instantiate a new object using form parameters
    @tag = Tag.new(tag_params)
    # Save object
    if @tag.save

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
  def edit
    @tag = Tag.find(params[:id])

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
  def update
    @tag = Tag.find(params[:id])

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 2 LIMIT 1
---
  def delete
    @tag = Tag.find(params[:id])

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 2 LIMIT 1
DELETE FROM `tags` WHERE `tags`.`id` = 2
---
  def destroy
    @tag = Tag.find(params[:id])
    @tag.destroy