app/controllers/tracks_controller.rb

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 0 LIMIT 1
---
  def show
    @track = Track.find(params[:id])

INSERT INTO `tracks` (`name`, `date_finished`, `location_finished`, `pitch`, `length`, `permalink`, `created_at`, `updated_at`) VALUES ('Track #1', '2017-09-08', 'Bergen', '10.000 Hz', '02:21:00', 'frog1', '2017-09-08 10:18:50', '2017-09-08 10:18:50')
---
  def create
    # Instantiate a new object using form parameters
    @track = Track.new(track_params)
    # Save object
    if @track.save

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 2 LIMIT 1
---
  def edit
    @track = Track.find(params[:id])

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 2 LIMIT 1
UPDATE `tracks` SET `sound_file_name` = 'Torn_Tracks__1.mp3', `sound_content_type` = 'audio/mpeg', `sound_file_size` = 6361827, `sound_updated_at` = '2017-09-20 13:53:50', `updated_at` = '2017-09-20 13:53:50' WHERE `tracks`.`id` = 1
---
  def update
    @track = Track.find(params[:id])
    if @track.update_attributes(track_params)

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 3 LIMIT 1
---
  def delete
    @track = Track.find(params[:id])

SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 3 LIMIT 1
DELETE FROM `tags_tracks` WHERE `tags_tracks`.`track_id` = 3
DELETE FROM `tracks` WHERE `tracks`.`id` = 3
---
  def destroy
    @track = Track.find(params[:id])
    @track.destroy