app/views/public/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `tags_tracks` ON `tags`.`id` = `tags_tracks`.`tag_id` WHERE `tags_tracks`.`track_id` = 1 AND `tags`.`visible` = 1 ORDER BY name ASC
---

<% @track.tags.visible.sorted.each do |tags| %>